# Getting Started with pandas

1. Review를 위한 단계
- 방식 : chapter05 장을 보면서 이해하고 주석 달기
- 제출 방식 : 강사가 제시한 폴더에 파일명 수정해서 제출하기
- 파일명 : **step03_bookReview임동원.ipynb**

In [4]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

## Introduction to pandas Data Structures

### Series

In [3]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.values # series의 데이터 값만 출력

array([ 4,  7, -5,  3], dtype=int64)

In [5]:
obj.index # index 정보 출력, 0에서 (4-1)까지 1씩 커지는 index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2.index # ['d', 'b', 'a', 'c']

Index(['d', 'b', 'a', 'c'], dtype='object')

In [9]:
obj2['a'] # 'a' 위치에 있는 데이터값 출력

-5

In [ ]:
obj2['d'] = 6

In [ ]:
obj2[['c', 'a', 'd']] # 'd' 위치를 제외한 모든 데이터값 출력

In [10]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [ ]:
obj2[obj2 > 0] # 데이터값이 양수인것만 출력

In [ ]:
obj2 * 2 # 모든 데이터에 2씩 곱해서 출력

In [11]:
np.exp(obj2)# exponential한 데이터값을 출력

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [12]:
'b' in obj2 # 'b'가 속해 있나

True

In [13]:
'e' in obj2 # False

False

In [14]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [15]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states) # states를 index로 정하고 sdata에서 key와 index를 비교해서 같은 것에 대해 value값 출력, 매핑
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [16]:
pd.isnull(obj4) # null값 존재유무

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [17]:
pd.notnull(obj4) # null값이 아닌 것 존재유무

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [18]:
obj4.isnull() # null값 존재 유무

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [19]:
obj3
obj4
obj3 + obj4 # index값이 같은 것은 데이터값을 합치고 index에 공통적인것이 없거나 값이 없는 경우 NaN 출력, sql의 양쪽join과 비슷한 맥락

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [20]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [21]:
obj4.name = 'population' # obj4라는 series의 이름을 population으로 지정
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [22]:
obj4.index.name = 'state' # obj4라는 series의 index이름을 state로 지정
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [23]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [24]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan'] # index이름을 다음과 같은 순서로 변환
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

In [26]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [27]:
data # 딕셔너리 타입

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [28]:
frame # dataframe 타입으로 변환

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [29]:
frame.head() # 위의 5개 출력

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [30]:
pd.DataFrame(data, columns=['year', 'state', 'pop']) # year, state, pop 순서로 column 순서 변경

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [42]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four','five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [43]:
frame2.columns # year, state, pop, debt 순으로 column 정렬

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [44]:
frame2['state'] # state에 해당하는 column 데이터만 출력

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [45]:
frame2.year # year에 해당하는 column 데이터만 출력

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [46]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [47]:
frame2.loc['three'] # index가 three인 row의 모든 데이터 출력

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [48]:
frame2['debt'] = 16.5 # dept column 데이터를 모두 16.5로 변환
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [49]:
frame2['debt'] = np.arange(6.) # 0.0 ~ 5.0까지의 부동소수점으로 1씩 증가하며 dept column에 순서대로 대입
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [50]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five']) # 3개의 row, 2개의 column 형태의 series 생성
frame2['debt'] = val # dept column에서 같은 index를 찾아 이에 해당하는 데이터값 대입
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [39]:
frame2['eastern'] = frame2.state == 'Ohio' # state가 ohio인 경우에만 True값이고 이 boolean값들을 eastern이라는 새 column에 대입
# frame2.state == 'Ohio'
# [True, True, True, False, False, False]
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [40]:
del frame2['eastern'] # eastern column 삭제
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [41]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [51]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [52]:
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [53]:
frame3.T # column과 index 위치도 바꾸면서 전치된 dataframe view

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [55]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [56]:
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [57]:
pd.DataFrame(pop)#, index=[2000, 2001, 2002])

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [ ]:
pd

In [ ]:
!pip show pandas # pandas 정보

In [58]:
# p167 교재와 다름, 
pd.DataFrame(pop, index=pd.Int64Index([2001, 2000, 2002])) # int타입으로 2001, 2000, 2002 순서로 데이터 값 출력

      Nevada  Ohio
2001     2.4   1.7
2000     NaN   1.5
2002     2.9   3.6

In [ ]:
frame3

In [59]:
frame3['Ohio'][:-1] # ohio column에서 마지막 row 빼고 전체 출력

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [ ]:
frame3['Ohio']

In [60]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata) # 마지막 row값 빼고 출력

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [ ]:
frame3

In [61]:
frame3.index.name = 'year' # index 이름은 year
frame3.columns.name = 'state' # column 이름은 state
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [62]:
frame3.values # frame3 데이터 값만

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [63]:
frame2.values # frame2 데이터 값만

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

### Index Objects

In [65]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])
obj

a    0
b    1
c    2
dtype: int64

In [66]:
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [67]:
index[1:] # ['b', 'c']

Index(['b', 'c'], dtype='object')

index[1] = 'd'  # TypeError

In [69]:
labels = pd.Index(np.arange(3))
labels # [0,1,2]

Int64Index([0, 1, 2], dtype='int64')

In [70]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [71]:
obj2.index #[0,1,2]

Int64Index([0, 1, 2], dtype='int64')

In [72]:
obj2.index is labels # index와 labels가 같은지

True

In [74]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [73]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [76]:
'Ohio' in frame3.columns # ohio가 frame3 column 내에 존재하는지

True

In [75]:
2003 in frame3.index # 2003이 frame3 index 내에 존재하는지
# 2000, 2001, 2002만 존재

False

In [77]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

## Essential Functionality

### Reindexing

In [5]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [6]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2 # obj는 index는 a,b,c,d이고 4개의 row만 존재 따라서 e는 기존에 index로 존재하지도 않기 때문에 NaN 값으로 나온다.

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [8]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [9]:
obj3.reindex(range(6), method='ffill') # index가 1,3,5인 값은 없었으므로 바로 전의 index 값으로 채워준다.

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [10]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])

In [11]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [12]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2 # frame index 목록에 없던 b는 NaN 값

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [13]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states) # 기존의 column 목록에 Utah는 없었으므로 해당 컬럼값은 모두 NaN

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

### Dropping Entries from an Axis 
**drop하면 해당 row 삭제**

In [25]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [15]:
new_obj = obj.drop('c')
new_obj # c row만 제거

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [ ]:
obj.drop(['d', 'c']) # d,c row 2개 삭제

In [16]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [17]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [18]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [19]:
data.drop('two', axis=1) # two column 제거, axis = 1에 해당

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [ ]:
data # 구조 변경

In [20]:
data.drop(['two', 'four'], axis='columns') # two, four인 column 삭제, two는 그 전에 삭제 했기 때문에 four만 삭제

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [24]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [23]:
obj.drop('c', inplace=True) # c를 원본 데이터에서 삭제
obj

KeyError: "['c'] not found in axis"

### Indexing, Selection, and Filtering

In [27]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [28]:
obj['b'] # 1.0

1.0

In [29]:
obj[1] # 1.0

1.0

In [30]:
obj[2:4] # [2.0, 3.0]

c    2.0
d    3.0
dtype: float64

In [31]:
obj[['b', 'a', 'd']] # [1.0, 0.0, 3.0]

b    1.0
a    0.0
d    3.0
dtype: float64

In [ ]:
obj[[1, 3]] # [1.0, 2.0]

In [32]:
obj[obj < 2] # [0.0, 1.0]

a    0.0
b    1.0
dtype: float64

In [ ]:
obj

In [ ]:
obj['b':'c'] # 1.0

In [ ]:
obj['b':'c'] = 5
obj # index b,c 데이터 값이 5로 변경

In [ ]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

In [ ]:
data['two'] #[1,5,9,13]

In [33]:
data[['three', 'one']]  # [[1,5,7,9],[0,4,8,12]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [34]:
data[:2] # 0, 1번째 row 출력

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [ ]:
data

In [35]:
data[data['three'] > 5] # three column에서 5 초과인 데이터들([6,10,14])이 속한 row 전체 데이터출력

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [36]:
data < 5 # 각 데이터값이 5보다 작으면 True, 나머지는 False 출력

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [37]:
data[data < 5] = 0 # 위에서 True값이 나온 cell은 0으로 변경

In [38]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### Selection with loc and iloc

In [39]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [40]:
data.loc['Colorado', ['two', 'three']] # index가 Colorado인 row에서 two, three column에 해당하는 데이터만 출력

two      5
three    6
Name: Colorado, dtype: int32

In [ ]:
data

In [41]:
data.iloc[2] # index가 2인(Utah) row 전체 데이터 출력

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [42]:
data.iloc[2, [3, 0, 1]] # ['Utah', 3]['Utah', 0]['Utah', 1] 순서로 출력, [11,8,9]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [43]:
data.iloc[[1, 2], [3, 0, 1]] # [1,3][1,0][1,1][2,3][2,0][2,1] 순서로 출력, [[7,0,5],[11,8,9]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [ ]:
data

In [44]:
data.loc[:'Utah', 'two'] # row는 Utah까지인 데이터 중에서 column two에 해당하는 값만 출력,[0,5,9]

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [45]:
# 1번째 : column이 0,1,2번째인 모든 데이터 출력 [[0,0,8,12],[0,5,9,13],[0,6,10,14]]
# 2번째 : 출력된 데이터 중에서 원본 데이터 three column 데이터 중 5 초과였던 데이터의 해당 row값을 index값으로 받아서
#         해당 row의 값만 출력 [[0,8,12],[5,6,13],[6,10,14]]
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### Integer Indexes
**loc : [x:y]이면 x 포함 y포함 index까지 값 출력<br>
  iloc : [x:y]이면 x포함 y미포함 index까지 값 출력**

ser = pd.Series(np.arange(3.))
ser
ser[-1]

In [47]:
ser = pd.Series(np.arange(3.))

In [48]:
ser # [0.0, 1.0, 2.0]

0    0.0
1    1.0
2    2.0
dtype: float64

In [50]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c']) # index [a,b,c]

In [51]:
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [52]:
ser2[-1] # 마지막 index값 출력, 2.0

2.0

In [53]:
ser[:1] # 첫번째 index 값 출력, 0.0

0    0.0
dtype: float64

In [54]:
ser.loc[:1] # 두번째 index값 출력 [0.0, 1.0]

0    0.0
1    1.0
dtype: float64

In [55]:
ser.iloc[:1] # 첫번째 index값만 출력 , 0.0

0    0.0
dtype: float64

### Arithmetic and Data Alignment

In [56]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [ ]:
s1

In [ ]:
s2

In [57]:
s1 + s2 # 공통적으로 존재하는 index에 해당하는 값은 서로 더하고, 공통적이지 않은 index 값들은 원래 값들이 존재해도 NaN으로 처리

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [58]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'), 
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [60]:
df1 # column은 b,c,d

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [61]:
df2 # column b,d,e

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [59]:
df1 + df2 # 각 셀 자체가 존재하는지 비교 , row와 column 위치가 완벽히 일치하는 곳만 더하고 나머지는 NaN

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [62]:
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'B': [3, 4]})

In [64]:
df1

   A
0  1
1  2

In [65]:
df2

   B
0  3
1  4

In [63]:
df1-df2 # index는 둘이 동일하므로  axis=1 방향으로 합쳐졌고 column 명이 동일하지 않아 전체 데이터가 NaN 처리

    A   B
0 NaN NaN
1 NaN NaN

#### Arithmetic methods with fill values

In [66]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))

In [69]:
df1 # column a,b,c,d

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [ ]:
df2 # column a,b,c,d,e

In [67]:
df2.loc[1, 'b'] = np.nan # row가 1이고 column이 b인 위치의 데이터들을 NaN 값으로 대체

In [68]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [70]:
df1 + df2 # row, column이 완벽히 동일한 위치의 셀은 더하고 나머지는 NaN

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [71]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [72]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [73]:
df1.add(df2, fill_value=0) # row, column 위치가 완벽히 일치하는 곳은 합산하고, 
#                            NaN 값은 0으로 처리해서 더하고 df1에 존재하지 않는 row와 column 데이터값은 df2 그대로 사용

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [74]:
df1 # 원본 데이터 변화 X

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [75]:
1 / df1

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [76]:
df1.rdiv(1)

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [77]:
df1.reindex(columns=df2.columns, fill_value=0) # df1의 column값을 df2 column 목록으로 하고 새로 추가된 부분은 0으로 채운다

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

#### Operations between DataFrame and Series

In [79]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [82]:
arr[0] #[0.0,1.0,2.0,3.0]

array([0., 1., 2., 3.])

In [81]:
arr - arr[0] # 각 row와 [0,1,2,3] 빼기 연산을 한 배열

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [83]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame # column은 b,d,e

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [84]:
series = frame.iloc[0]

In [85]:
series # [0.0,1.0,2.0]

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [86]:
frame - series # 각 row에서 series와 빼기 연산 , 원본 유지

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [87]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [88]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])

In [89]:
series2

b    0
e    1
f    2
dtype: int64

In [90]:
frame + series2 # 공통적으로 존재하는 column 데이터값에는 series2 값을 더해주고 존재하지 않으면 NaN
#                 원본 데이터 변화 X

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [91]:
series3 = frame['d']

In [92]:
series3 # 원본 frame 데이터 그대로

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [ ]:
frame

In [95]:
frame.sub(series3, axis='index') # frame 데이터에서 series3 데이터값을 빼준다. 축 방향은 index으로

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [94]:
frame.sub(series3, axis=0) # 위와 동일

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [97]:
frame.sub(series3, axis='columns')

        Ohio  Oregon  Texas  Utah   b   d   e
Utah     NaN     NaN    NaN   NaN NaN NaN NaN
Ohio     NaN     NaN    NaN   NaN NaN NaN NaN
Texas    NaN     NaN    NaN   NaN NaN NaN NaN
Oregon   NaN     NaN    NaN   NaN NaN NaN NaN

### Function Application and Mapping

In [98]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame # column b,d,e

               b         d         e
Utah    0.451198 -0.804458 -1.742497
Ohio   -0.057022 -0.725947  0.326165
Texas   0.232514  0.550538 -1.031113
Oregon -0.642589  0.544456  0.679927

In [99]:
np.abs(frame) # 모든 데이터값 절대값으로 변환

               b         d         e
Utah    0.451198  0.804458  1.742497
Ohio    0.057022  0.725947  0.326165
Texas   0.232514  0.550538  1.031113
Oregon  0.642589  0.544456  0.679927

In [100]:
frame

               b         d         e
Utah    0.451198 -0.804458 -1.742497
Ohio   -0.057022 -0.725947  0.326165
Texas   0.232514  0.550538 -1.031113
Oregon -0.642589  0.544456  0.679927

In [101]:
f = lambda x: x.max() - x.min()
frame.apply(f) # 각 컬럼별 최대값과 최소값 차이 구하기

b    1.093788
d    1.354996
e    2.422424
dtype: float64

In [102]:
frame.apply(f, axis='columns') # 축을 column 방향으로 , row 내에서 최대값과 최소값 차이 구하기

Utah      2.193696
Ohio      1.052112
Texas     1.581651
Oregon    1.322517
dtype: float64

In [ ]:
frame.apply(f, axis=1) # 위와 동일

In [ ]:
frame

In [103]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)# index는 min, max로 각 컬럼의 최대값, 최소값을 출력

            b         d         e
min -0.642589 -0.804458 -1.742497
max  0.451198  0.550538  0.679927

In [105]:
format = lambda x: '%.2f' % x
frame.applymap(format) # 데이터를 소수점 2번째 자리까지만 출력, 내림이다.
#                        각 cell에 해당하는 값을 문자열형태로 변환

            b      d      e
Utah     0.45  -0.80  -1.74
Ohio    -0.06  -0.73   0.33
Texas    0.23   0.55  -1.03
Oregon  -0.64   0.54   0.68

In [107]:
type(frame.applymap(format)['b']['Utah'])

str

In [109]:
frame['e'].map(format) # 위와 같은 방법으로 column e에 해당하는 값들만 문자열로 변환

Utah      -1.74
Ohio       0.33
Texas     -1.03
Oregon     0.68
Name: e, dtype: object

In [110]:
frame

               b         d         e
Utah    0.451198 -0.804458 -1.742497
Ohio   -0.057022 -0.725947  0.326165
Texas   0.232514  0.550538 -1.031113
Oregon -0.642589  0.544456  0.679927

### Sorting and Ranking

In [112]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [113]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [114]:
obj.sort_index() # index를 오름차순으로 정렬

a    1
b    2
c    3
d    0
dtype: int64

In [116]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])

In [117]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [118]:
frame.sort_index() # axis=0 one, three 순으로 정렬, 알파벳 순서

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [119]:
frame.sort_index(axis=1) # axis=1을 오름차순으로 정렬, column 정렬

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [120]:
frame # 워본 변화 X

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [121]:
frame.sort_index(axis=1, ascending=False)  # axis =1 방향 내림차순 정렬

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [122]:
obj = pd.Series([4, 7, -3, 2])

In [ ]:
obj

In [123]:
obj.sort_values() # 오름차순으로 정렬 , 값에 해당하는 index 순서로 나옴

2   -3
3    2
0    4
1    7
dtype: int64

In [124]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [126]:
obj.sort_values() # NaN 제외 오름차순 정렬한 후 NaN에 해당하는 index는 오름차순으로 저열

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [127]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [128]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [129]:
frame.sort_values(by='b') # b를 기준으로 오름차순으로 정렬하고 그에 해당하는 index 순서로 변화

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [130]:
frame.sort_values(by=['a', 'b']) # a기준으로 먼저 정렬한 후, b기준으로 정렬

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [131]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [132]:
obj.rank() # 오름차순으로 가장 낮은 값부터 1순위를 매긴다. 동점인 경우 평균 순위를 매김, 4와 5순위일 경우 4.5순위로 둘다 변경

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [133]:
obj.rank(method='first') # 동일한 값일 때 데이터 생성할 때 먼저 나온 순서대로 순위 매김

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [135]:
obj.rank(ascending=False, method='max') # 내림차순, 동일한 값일 경우 해당값의 나중 순서로 랭킹
#                                          1,2순위일 때 -> 둘다 2순위

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [136]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [137]:
frame.rank(axis=1) # row 내에서 내림차순으로 순서 매김, 순서가 출력됨

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [138]:
frame.rank('columns') # 위와 동일

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

### Axis Indexes with Duplicate Labels

In [139]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
#obj = pd.Series(range(3), index=['a', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [140]:
obj.index.is_unique # index 중복여부

False

In [141]:
obj['a'] # index a에 해당하는 모든 데이터값 출력

a    0
a    1
dtype: int64

In [142]:
obj['c'] # index c에 해당하는 모든 데이터값 출력

4

In [144]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a -0.730150  1.240302  0.305637
a -0.643927  1.013145 -0.474991
b -0.066972 -1.158661 -0.383548
b -0.187760  1.177094 -0.510379

In [145]:
df.loc['b'] # index가 b인 row 모든 데이터 출력

          0         1         2
b -0.066972 -1.158661 -0.383548
b -0.187760  1.177094 -0.510379

## Summarizing and Computing Descriptive Statistics

In [146]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [147]:
df.sum() # column별로 합함, NaN 값 무시

one    9.25
two   -5.80
dtype: float64

In [148]:
df.sum(axis='columns') # row별로 합함, NaN일 경우 0.00으로 처리

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [149]:
df.mean(axis='columns', skipna=False) # NaN값을 무시하지 않고 각 row별 평균 구하기, NaN값 존재하면 출력값도 NaN

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [150]:
df.mean(axis='columns', skipna=True) # 위 상황과 반대, 모든 cell이 NaN일 경우 NaN 출력

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [151]:
df.idxmax() # 각 column 내에서 최대값을 가지는 데이터의 index값 출력

one    b
two    d
dtype: object

In [ ]:
df

In [153]:
df.cumsum() # 누적합, NaN 무시

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [155]:
df.describe() # 요약통계

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [156]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj # [a,a,b,c]가 4번 반복됨.

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [157]:
obj.describe() # 수치데이터일때와 다른 요약 통계

count     16
unique     3
top        a
freq       8
dtype: object

### Unique Values, Value Counts, and Membership

In [158]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [159]:
uniques = obj.unique()
uniques # 중복을 제거한 유일한 값만 출력

array(['c', 'a', 'd', 'b'], dtype=object)

In [160]:
obj.value_counts() # 각 데이터값들의 갯수 출력

a    3
c    3
b    2
d    1
dtype: int64

In [161]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [163]:
mask = obj.isin(['b', 'c'])
mask # b또는 c를 가지고 있는 데이터이면 True, 아니면 False

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [164]:
obj[mask] # True인 경우의 데이터만 출력

0    c
5    b
6    b
7    c
8    c
dtype: object

In [165]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])

In [166]:
to_match

0    c
1    a
2    b
3    b
4    c
5    a
dtype: object

In [167]:
unique_vals = pd.Series(['c', 'b', 'a'])

In [168]:
unique_vals

0    c
1    b
2    a
dtype: object

In [171]:
# 1번째 : c-0, b-1, a-2에 매칭되었음
# 2번째 : to_match 데이터가 unique_vals에 있는지 보고 그 해당 인덱스 값을 반환
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [175]:
pd.Index(unique_vals)

'c'

In [180]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [178]:
result = data.apply(pd.value_counts).fillna(0) # 존재하지 않는 NaN은 0으로 채우기
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [182]:
data.apply(pd.value_counts) # column 별로 각 숫자가 몇번나오는지 count
#                             1,2,3,4,5는 data 내에 해당하는 unique한 값들

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

## 누락된 데이터 처리하기

1. 누락된 데이터를 처리하는 일은 데이터 분석 애플리케이션에서 빈번한 작업
- 모든 기술 통계는 누락된 데이터를 배제하고 처리
- 처리 방법 1 : 수집된 데이터를 직접 제거
- 처리 방법 2 : dropna 함수 사용하여 처리

In [183]:
from numpy import nan as NA

Series의 NA값 제거해 보기

In [184]:
data = Series([1, NA, 3.5, NA, 7])

In [ ]:
data

In [185]:
data.dropna() # Na값 제거, 원본데이터 변화 X

0    1.0
2    3.5
4    7.0
dtype: float64

In [186]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [187]:
data[data.notnull()] # null값이 아닌 데이터의 index값을 반환받고 그 index에 해당하는 데이터 출력

0    1.0
2    3.5
4    7.0
dtype: float64

DataFrame의 NA값 제거하기

In [188]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [189]:
cleaned = data.dropna() # NaN가 존재하는 row 통째로 삭제
cleaned

     0    1    2
0  1.0  6.5  3.0

In [190]:
data # 원본 데이터 변화 X

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [191]:
data.dropna(how='all') # row 전체가 null값인 경우에만 삭제

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [194]:
data # 원본 데이터 변화 X

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [193]:
data[4] = NA # 4번째 column 모두 NaN
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [197]:
df = DataFrame(np.random.randn(7, 3))

In [198]:
df

          0         1         2
0  0.299533  0.831896  1.937139
1  0.394938 -1.119643  0.224733
2  0.406526 -1.768700 -0.506992
3  1.285321  1.140796  0.275578
4  0.146392 -0.427262 -0.109808
5 -0.128921 -2.143452 -2.339104
6 -0.216627 -0.375876  1.215180

In [200]:
df.loc[:4, 1] = NA # 0~4까지 row, column이 1인 경우 데이터 NA로 변환

In [201]:
df

          0         1         2
0  0.299533       NaN  1.937139
1  0.394938       NaN  0.224733
2  0.406526       NaN -0.506992
3  1.285321       NaN  0.275578
4  0.146392       NaN -0.109808
5 -0.128921 -2.143452 -2.339104
6 -0.216627 -0.375876  1.215180

In [202]:
df.loc[:2, 2] = NA # 0~2까지 row, column이 2인 경우 데이터 NA로 변환
df

          0         1         2
0  0.299533       NaN       NaN
1  0.394938       NaN       NaN
2  0.406526       NaN       NaN
3  1.285321       NaN  0.275578
4  0.146392       NaN -0.109808
5 -0.128921 -2.143452 -2.339104
6 -0.216627 -0.375876  1.215180

In [203]:
df.dropna(thresh=3) # 3개이상의 데이터만 들어있는 row만 출력

          0         1         2
5 -0.128921 -2.143452 -2.339104
6 -0.216627 -0.375876  1.215180

In [ ]:
df

In [205]:
df.dropna(thresh=2, axis=0) # 2개이상의 데이터를 가지지 않은 row 삭제

          0         1         2
3  1.285321       NaN  0.275578
4  0.146392       NaN -0.109808
5 -0.128921 -2.143452 -2.339104
6 -0.216627 -0.375876  1.215180

In [206]:
d f# 워본 데이터 변화 없음

          0         1         2
0  0.299533       NaN       NaN
1  0.394938       NaN       NaN
2  0.406526       NaN       NaN
3  1.285321       NaN  0.275578
4  0.146392       NaN -0.109808
5 -0.128921 -2.143452 -2.339104
6 -0.216627 -0.375876  1.215180

In [207]:
df.dropna(thresh=5, axis=1) # column내에 5이상의 데이터가 없는 경우 삭제

          0
0  0.299533
1  0.394938
2  0.406526
3  1.285321
4  0.146392
5 -0.128921
6 -0.216627

In [208]:
df.dropna(thresh=3, axis=1) # column내에 3이상의 데이터가 없는 경우 삭제

          0         2
0  0.299533       NaN
1  0.394938       NaN
2  0.406526       NaN
3  1.285321  0.275578
4  0.146392 -0.109808
5 -0.128921 -2.339104
6 -0.216627  1.215180

**누락된 값 채우기**

In [209]:
df

          0         1         2
0  0.299533       NaN       NaN
1  0.394938       NaN       NaN
2  0.406526       NaN       NaN
3  1.285321       NaN  0.275578
4  0.146392       NaN -0.109808
5 -0.128921 -2.143452 -2.339104
6 -0.216627 -0.375876  1.215180

In [210]:
df.fillna(0)  # NaN값을 0으로 변환

          0         1         2
0  0.299533  0.000000  0.000000
1  0.394938  0.000000  0.000000
2  0.406526  0.000000  0.000000
3  1.285321  0.000000  0.275578
4  0.146392  0.000000 -0.109808
5 -0.128921 -2.143452 -2.339104
6 -0.216627 -0.375876  1.215180

In [211]:
df # 원본 데이터 변화 없음.

          0         1         2
0  0.299533       NaN       NaN
1  0.394938       NaN       NaN
2  0.406526       NaN       NaN
3  1.285321       NaN  0.275578
4  0.146392       NaN -0.109808
5 -0.128921 -2.143452 -2.339104
6 -0.216627 -0.375876  1.215180

In [212]:
df.fillna({1:0.5, 3:-1}) # column1에서 NaN은 0.5, column3에서는 -1로 바꿈. 3은 없으므로 해당사항 없음.

          0         1         2
0  0.299533  0.500000       NaN
1  0.394938  0.500000       NaN
2  0.406526  0.500000       NaN
3  1.285321  0.500000  0.275578
4  0.146392  0.500000 -0.109808
5 -0.128921 -2.143452 -2.339104
6 -0.216627 -0.375876  1.215180

In [213]:
df # 원본 데이터 변화 없음

          0         1         2
0  0.299533       NaN       NaN
1  0.394938       NaN       NaN
2  0.406526       NaN       NaN
3  1.285321       NaN  0.275578
4  0.146392       NaN -0.109808
5 -0.128921 -2.143452 -2.339104
6 -0.216627 -0.375876  1.215180

In [215]:
df.fillna({2:10}) # column2에서 NaN은 10으로 변환

          0         1          2
0  0.299533       NaN  10.000000
1  0.394938       NaN  10.000000
2  0.406526       NaN  10.000000
3  1.285321       NaN   0.275578
4  0.146392       NaN  -0.109808
5 -0.128921 -2.143452  -2.339104
6 -0.216627 -0.375876   1.215180

In [ ]:
df

## 계층적 색인

1. pandas의 중요한 기능
- 축에 대해 다중(2개 이상) 색인 단계 지정 가능(MultiIndex)
- 고차원 데이터를 낮은 차원의 형식으로 다룰수 있게 해주는 기능

In [216]:
data = Series(np.random.randn(10), 
              index=[
                      ['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'], 
                      [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]
              ])

In [217]:
data

a  1   -0.446084
   2   -0.318791
   3    0.948943
b  1    0.399868
   2    0.533275
   3   -0.747697
c  1   -0.832673
   2   -1.477424
d  2    0.568711
   3    0.535795
dtype: float64

In [218]:
data.index 
'''
levels는 상위계층부터 하위계층까지 unique한 index값 출력
labels는 데이터 생성시 index 상위계층에 존재하는 데이터를 index와 매핑해서 보여줌

1. levels의 첫번째 배열에서의 index에 따라
a-0 b-1 c-2 d-3

2. levels의 두번째 배열에서의 index에 다라
1-0 2-1 3-2

'''

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [219]:
data.values

array([-0.44608366, -0.31879071,  0.94894316,  0.39986772,  0.53327474,
       -0.74769726, -0.83267344, -1.47742393,  0.56871147,  0.53579477])

**계층적으로 색인된 객체는 데이터의 부분 집합을 부분적 색인으로 접근이 가능**

In [220]:
data['b']

1    0.399868
2    0.533275
3   -0.747697
dtype: float64

In [223]:
data['b':'c'] # 인덱스 b,c의 데이터 모두 출력

b  1    0.399868
   2    0.533275
   3   -0.747697
c  1   -0.832673
   2   -1.477424
dtype: float64

In [224]:
type(data['b':'c'])

pandas.core.series.Series

In [225]:
data.loc[['b', 'c']] # 위와 동일

b  1    0.399868
   2    0.533275
   3   -0.747697
c  1   -0.832673
   2   -1.477424
dtype: float64

In [226]:
type(data.loc[['b', 'c']])

pandas.core.series.Series

In [227]:
data

a  1   -0.446084
   2   -0.318791
   3    0.948943
b  1    0.399868
   2    0.533275
   3   -0.747697
c  1   -0.832673
   2   -1.477424
d  2    0.568711
   3    0.535795
dtype: float64

**하위 계층의 객체 선택**

In [228]:
data[:, 2] # 모든 상위계층 별로 하위계층에서  column이 2에 해당하는 데이터 출력

a   -0.318791
b    0.533275
c   -1.477424
d    0.568711
dtype: float64

**계층적인 색인은 데이터를 재형성 가능**

In [230]:
data.unstack() # 상위 계층은 index로, 하위게층은 column으로/ 계층 형태아닌 새로운 형태로 출력

          1         2         3
a -0.446084 -0.318791  0.948943
b  0.399868  0.533275 -0.747697
c -0.832673 -1.477424       NaN
d       NaN  0.568711  0.535795

In [231]:
data

a  1   -0.446084
   2   -0.318791
   3    0.948943
b  1    0.399868
   2    0.533275
   3   -0.747697
c  1   -0.832673
   2   -1.477424
d  2    0.568711
   3    0.535795
dtype: float64

In [232]:
data.unstack().stack() # 계층 형태로 출력

a  1   -0.446084
   2   -0.318791
   3    0.948943
b  1    0.399868
   2    0.533275
   3   -0.747697
c  1   -0.832673
   2   -1.477424
d  2    0.568711
   3    0.535795
dtype: float64

In [233]:
frame = DataFrame(np.arange(12).reshape(4,3), 
                  index=[['a','a','b','b'], [1, 2, 1, 2]], 
                  columns=[['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']])

In [234]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [235]:
frame.index

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [236]:
frame.index.names

FrozenList([None, None])

In [237]:
frame.index.names = ['key1', 'key2']

In [240]:
frame.index.names

FrozenList(['key1', 'key2'])

In [241]:
frame.index

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]],
           names=['key1', 'key2'])

In [242]:
frame.columns

MultiIndex(levels=[['Colorado', 'Ohio'], ['Green', 'Red']],
           labels=[[1, 1, 0], [0, 1, 0]])

In [243]:
frame.columns.names = ['state', 'color']

In [244]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [245]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

**계층 순서 바꾸고 정렬하기**

In [246]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [247]:
frame.swaplevel('key1', 'key2') # key2와 key1의 계층관계를 바꿈. key2가 상위계층이므로 key1은 이에 맞게 하위계층 생성

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [248]:
frame # 원본데이터 변화 없음

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [250]:
frame.sort_index(1) # state에 대해 정렬, 나머지는 변화 없음

state     Colorado  Ohio
color        Green Green Red
key1 key2
a    1           2     0   1
     2           5     3   4
b    1           8     6   7
     2          11     9  10

In [251]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

단계별 요약통계
> level 옵션 : 한축에 대해 합을 구하고 싶은 단계 지정할 수 있는 옵션

In [ ]:
frame

In [252]:
frame.sum() # 최하위계층 column별로 합계 구함

state     color
Ohio      Green    18
          Red      22
Colorado  Green    26
dtype: int64

In [253]:
frame.sum(level='key2') # key2별로 합계를 구함

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

**DataFrame의 컬럼 사용하기**

In [254]:
frame = DataFrame({'a':range(7), 'b':range(7, 0, -1), 
                   'c':['one', 'one', 'one', 'two', 'two', 'two', 'two'], 
                   'd' : [0, 1, 2, 0, 1, 2, 3]})

In [255]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [256]:
# 하나 이상의 칼럼을 색인으로 하는 새로운 DataFrame 생성
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [257]:
frame # 원본 데이터 변화 없음.

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [258]:
# 명시적으로 컬럼 남겨두기
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [259]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [260]:
#계층적 색인 단계를 칼럼으로 이동
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1